ProService/src/Documents/ЗаявкаНаРемонт/ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРемонт</name>
  <basedOn>Document.ЗаявкаНаРемонт</basedOn>
  <registerRecords>InformationRegister.КонтактныйТелефон</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.Выручка</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Фирма</name>
    <type>
      <types>CatalogRef.ФирмаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Неисправность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЗаявкаНаРемонт_Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гарантийный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектация</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактыйТелефон</name>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплата</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>EnumRef.ВидыРасчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыРабот</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ProService/src/AccumulationRegisters/Выручка/Выручка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Выручка</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ProService/src/AccumulationRegisters/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияДенежныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ProService/src/Enums/ЗаявкаНаРемонт_Статусы/ЗаявкаНаРемонт_Статусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗаявкаНаРемонт_Статусы</name>
  <enumValues>
    <name>Принято</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Готово</name>
  </enumValues>
  <enumValues>
    <name>Закрыто</name>
  </enumValues>
</mdclass:Enum>

ProService/src/Documents/ЗаявкаНаРемонт/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим) 
	// регистр Выручка 
	Если Статус = Перечисления.ЗаявкаНаРемонт_Статусы.Закрыто И НЕ Гарантийный Тогда
		Движения.Выручка.Записывать = Истина;
		Движение = Движения.Выручка.Добавить();
		Движение.Период = Дата;
		Движение.Оборудование = Модель;
		Движение.Сумма = СуммаОплат;
		
	// регистр ДвиженияДенежныхСредств
		Движения.ДвиженияДенежныхСредств.Записывать = Истина;
		Движение = Движения.ДвиженияДенежныхСредств.Добавить();
		Движение.Период = Дата;
		Движение.СтатьяДвиженияДенежныхСредств = ПредопределенноеЗначение("Справочник.СтатьиДвиженияДенежныхСредств.ПриемВыручки");
		Движение.Сумма = +СуммаОплат;
	КонецЕсли;

КонецПроцедуры 

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
		Префикс = ЭтотОбъект.Модель.Фирма.Код;
		
	//Если СтрНайти(ЭтотОбъект.Номер, КодФирмы) <> 1 Тогда 
	//	ЭтотОбъект.Номер = КодФирмы+"-"+Прав(ЭтотОбъект.Номер,10-(СтрДлина(КодФирмы)+1));
	//КонецЕсли;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
		// Заполнение шапки
		ВидОборудования = ДанныеЗаполнения.ВидОборудования;
		Клиент = ДанныеЗаполнения.Клиент;
		Модель = ДанныеЗаполнения.Модель;
		СерийныйНомер = ДанныеЗаполнения.СерийныйНомер;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Фирма = ДанныеЗаполнения.Фирма;
		Гарантийный = НЕ ДанныеЗаполнения.Гарантийный;
		Для Каждого ТекСтрокаКомплектация Из ДанныеЗаполнения.Комплектация Цикл
			НоваяСтрока = Комплектация.Добавить();
			НоваяСтрока.Количество = ТекСтрокаКомплектация.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаКомплектация.Номенклатура;
		КонецЦикла;
		Для Каждого ТекСтрокаКонтактыйТелефон Из ДанныеЗаполнения.КонтактыйТелефон Цикл
			НоваяСтрока = КонтактыйТелефон.Добавить();
			НоваяСтрока.НомерТелефона = ТекСтрокаКонтактыйТелефон.НомерТелефона;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
